new.org
** Eyecandy
:PROPERTIES:
:CUSTOM_ID: cfg-eyecandy
:END:

Some eyecandy is good.

#+BEGIN_SRC emacs-lisp :tangle config/config-eyecandy.el
  (defgroup dotemacs-eyecandy nil
    "Configuration options for eye candy."
    :group 'dotemacs
    :prefix 'dotemacs-eyecandy)

  (defcustom dotemacs-eyecandy/mode-line
    'sml
    "List of hooks to automatically start up in Evil Emacs state."
    :type '(radio
            (const :tag "smart mode line" sml)
            (const :tag "spaceline" spaceline))
    :group 'dotemacs-eyecandy)

  (defcustom dotemacs-eyecandy/folding
    'origami
    "The library to use for folding."
    :type '(radio
            (const :tag "origami" origami)
            (const :tag "hide-show" hide-show))
    :group 'dotemacs-eyecandy)

  (defcustom dotemacs-eyecandy/color-theme
    'default
    "Emacs color theme."
    :type '(radio
            (const :tag "default" manjo-dark)
            (const :tag "sanityinc-tomorrow-bright" sanityinc-tomorrow-bright)
            (const :tag "gruvbox-dark-hard" gruvbox-dark-hard))
    :group 'dotemacs-eyecandy)
#+END_SRC

Color theme config.

#+BEGIN_SRC emacs-lisp :tangle config/config-eyecandy.el
  (cond
   ;; default color theme
   ((eq dotemacs-eyecandy/color-theme 'default)
    (load-theme 'manoj-dark t))
   ;; tomorrow bright
   ((eq dotemacs-eyecandy/color-theme 'sanityinc-tomorrow-bright)
    (require-package 'color-theme-sanityinc-tomorrow)
    (load-theme 'sanityinc-tomorrow-bright t))
   ;; gruvbox dark
   ((eq dotemacs-eyecandy/color-theme 'gruvbox-dark-hard)
    (require-package 'gruvbox-theme)
    (load-theme 'gruvbox-dark-hard t)))
#+END_SRC

If the selected pair engine is Emacs, then activate =show-paren-mode= and set
its delay to 0. Also there is some mode to display stuff in the modeline that
are very useful.

#+BEGIN_SRC emacs-lisp :tangle config/config-eyecandy.el
  (when (eq dotemacs-pair-engine 'emacs)
    (show-paren-mode)
    (setq show-paren-delay 0))

  (line-number-mode t)
  (column-number-mode t)
  (display-time-mode t)
  (size-indication-mode t)
#+END_SRC

Here is the configuration regarding the preferred folding method.

#+BEGIN_SRC emacs-lisp :tangle config/config-eyecandy.el
  (cond
   ((eq dotemacs-eyecandy/folding 'origami)
    (progn
      (require-package 'origami)
      (global-origami-mode)))
   ((eq dotemacs-eyecandy/folding 'hide-show)
    (progn
      (defun /eyecandy/fold-overlay (ov)
        (when (eq 'code (overlay-get ov 'hs))
          (let ((col (save-excursion
                       (move-end-of-line 0)
                       (current-column)))
                (count (count-lines (overlay-start ov) (overlay-end ov))))
            (overlay-put ov 'after-string
                         (format "%s [ %d ] ... "
                                 (make-string (- (window-width) col 32) (string-to-char "."))
                                 count)))))
      (setq hs-set-up-overlay '/eyecandy/fold-overlay)
      (add-hook 'prog-mode-hook #'hs-minor-mode))))
#+END_SRC

The =diminish= package hides minor modes from the modeline.

#+BEGIN_SRC emacs-lisp :tangle config/config-eyecandy.el
  (require-package 'diminish)
  (diminish 'visual-line-mode)
  (after 'aggressive-indent (diminish 'aggressive-indent-mode))
  (after 'auto-complete (diminish 'auto-complete-mode))
  (after 'autorevert (diminish #'auto-revert-mode))
  (after 'color-identifiers-mode (diminish 'color-identifiers-mode))
  (after 'company (diminish 'company-mode))
  (after 'counsel (diminish #'counsel-mode))
  (after 'eldoc (diminish 'eldoc-mode))
  (after 'elisp-slime-nav (diminish 'elisp-slime-nav-mode))
  (after 'evil-commentary (diminish 'evil-commentary-mode))
  (after 'flycheck (diminish 'flycheck-mode))
  (after 'git-gutter+ (diminish 'git-gutter+-mode))
  (after 'helm-mode (diminish 'helm-mode))
  (after 'hideshow (diminish 'hs-minor-mode))
  (after 'highlight-symbol (diminish 'highlight-symbol-mode))
  (after 'indent-guide (diminish 'indent-guide-mode))
  (after 'ivy (diminish 'ivy-mode))
  (after 'page-break-lines (diminish 'page-break-lines-mode))
  (after 'projectile (diminish 'projectile-mode))
  (after 'smartparens (diminish 'smartparens-mode))
  (after 'undo-tree (diminish 'undo-tree-mode))
  (after 'which-key (diminish 'which-key-mode))
  (after 'yasnippet (diminish 'yas-minor-mode))
#+END_SRC

Configure the preferred modeline package. I could edit the default modeline,
but =smart-mode-line=, my preferred modeline, is very simple already and very
lightweight.

#+BEGIN_SRC emacs-lisp :tangle config/config-eyecandy.el
  (if (eq dotemacs-eyecandy/mode-line 'sml)
      (progn
        (require-package 'smart-mode-line)
        (setq sml/theme 'dark)
        (setq sml/no-confirm-load-theme t)
        (sml/setup))
    (require-package 'spaceline)
    (require 'spaceline-config)
    (setq spaceline-highlight-face-func #'spaceline-highlight-face-evil-state)
    (set-face-attribute 'spaceline-evil-emacs nil :background "red" :foreground "white")
    (spaceline-spacemacs-theme)
    (spaceline-info-mode)
    (after "helm-autoloads"
           (spaceline-helm-mode)))
#+END_SRC

=prettify-symbols-mode= makes some keywords into their correspondent unicode
characters. For exemple, alpha becomes α, lambda becomes λ and etc...

#+BEGIN_SRC emacs-lisp :tangle config/config-eyecandy.el
  (when (fboundp 'global-prettify-symbols-mode)
    (global-prettify-symbols-mode)
    (add-hook 'js2-mode-hook
              (lambda ()
                (push '("function" . 955) prettify-symbols-alist)
                (push '("return" . 8592) prettify-symbols-alist))))
#+END_SRC

These are some eye candy packages. If you're interested in any of them just look
them up on your favorite search engine.

#+BEGIN_SRC emacs-lisp :tangle config/config-eyecandy.el
  (/boot/delayed-init
   (require-package 'color-identifiers-mode)
   (global-color-identifiers-mode)
   (diminish 'color-identifiers-mode))

  (require-package 'highlight-symbol)
  (setq highlight-symbol-idle-delay 0.3)
  (add-hook 'prog-mode-hook 'highlight-symbol-mode)

  (require-package 'highlight-numbers)
  (add-hook 'prog-mode-hook 'highlight-numbers-mode)

  (require-package 'highlight-quoted)
  (add-hook 'prog-mode-hook 'highlight-quoted-mode)

  (require-package 'page-break-lines)
  (global-page-break-lines-mode)

  (require-package 'eval-sexp-fu)
  (require 'eval-sexp-fu)
  (eval-sexp-fu-flash-mode)

  (when (and (display-graphic-p)
           (font-info "all-the-icons"))
    (setq all-the-icons-scale-factor 0.7)
    (setq inhibit-compacting-font-caches t)

    (after 'dired
           (require-package 'all-the-icons-dired)
           (add-hook 'dired-mode-hook #'all-the-icons-dired-mode))

    (after 'ivy
           (require-package 'all-the-icons-ivy)
           (all-the-icons-ivy-setup)))

  (add-hook 'find-file-hook #'hl-line-mode)

  (if (fboundp #'display-line-numbers-mode)
      (add-hook 'find-file-hook #'display-line-numbers-mode)
    (add-hook 'find-file-hook 'linum-mode))

  (provide 'config-eyecandy)
#+END_SRC
